{"class_name": "Model", "config": {"name": "squeezenet", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv", "class_name": "Conv2D", "config": {"name": "conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "relu_conv1", "class_name": "Activation", "config": {"name": "relu_conv1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"name": "fire2/squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire2/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "fire2/relu.squeeze1x1", "class_name": "Activation", "config": {"name": "fire2/relu.squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/expand1x1", "class_name": "Conv2D", "config": {"name": "fire2/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/expand3x3", "class_name": "Conv2D", "config": {"name": "fire2/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/relu.expand1x1", "class_name": "Activation", "config": {"name": "fire2/relu.expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"name": "fire2/relu.expand3x3", "class_name": "Activation", "config": {"name": "fire2/relu.expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"name": "fire2/concat", "class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["fire2/relu.expand1x1", 0, 0, {}], ["fire2/relu.expand3x3", 0, 0, {}]]]}, {"name": "fire3/squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire3/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"name": "fire3/relu.squeeze1x1", "class_name": "Activation", "config": {"name": "fire3/relu.squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/expand1x1", "class_name": "Conv2D", "config": {"name": "fire3/expand1x1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire3/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/expand3x3", "class_name": "Conv2D", "config": {"name": "fire3/expand3x3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire3/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/relu.expand1x1", "class_name": "Activation", "config": {"name": "fire3/relu.expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]]}, {"name": "fire3/relu.expand3x3", "class_name": "Activation", "config": {"name": "fire3/relu.expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]]}, {"name": "fire3/concat", "class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["fire3/relu.expand1x1", 0, 0, {}], ["fire3/relu.expand3x3", 0, 0, {}]]]}, {"name": "fire4/squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire4/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire3/concat", 0, 0, {}]]]}, {"name": "fire4/relu.squeeze1x1", "class_name": "Activation", "config": {"name": "fire4/relu.squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/expand1x1", "class_name": "Conv2D", "config": {"name": "fire4/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/expand3x3", "class_name": "Conv2D", "config": {"name": "fire4/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/relu.expand1x1", "class_name": "Activation", "config": {"name": "fire4/relu.expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"name": "fire4/relu.expand3x3", "class_name": "Activation", "config": {"name": "fire4/relu.expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"name": "fire4/concat", "class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["fire4/relu.expand1x1", 0, 0, {}], ["fire4/relu.expand3x3", 0, 0, {}]]]}, {"name": "fire5/squeeze1x1", "class_name": "Conv2D", "config": {"name": "fire5/squeeze1x1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"name": "fire5/relu.squeeze1x1", "class_name": "Activation", "config": {"name": "fire5/relu.squeeze1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/expand1x1", "class_name": "Conv2D", "config": {"name": "fire5/expand1x1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire5/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/expand3x3", "class_name": "Conv2D", "config": {"name": "fire5/expand3x3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fire5/relu.squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/relu.expand1x1", "class_name": "Activation", "config": {"name": "fire5/relu.expand1x1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]]}, {"name": "fire5/relu.expand3x3", "class_name": "Activation", "config": {"name": "fire5/relu.expand3x3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]]}, {"name": "fire5/concat", "class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": true, "dtype": "float32", "axis": 3}, "inbound_nodes": [[["fire5/relu.expand1x1", 0, 0, {}], ["fire5/relu.expand3x3", 0, 0, {}]]]}, {"name": "drop9", "class_name": "Dropout", "config": {"name": "drop9", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["fire5/concat", 0, 0, {}]]]}, {"name": "conv10", "class_name": "Conv2D", "config": {"name": "conv10", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["drop9", 0, 0, {}]]]}, {"name": "relu_conv10", "class_name": "Activation", "config": {"name": "relu_conv10", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"name": "global_average_pooling2d", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]]}, {"name": "loss", "class_name": "Activation", "config": {"name": "loss", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["loss", 0, 0]]}, "keras_version": "2.1.6-tf", "backend": "tensorflow"}